tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Core tools
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "stow"
brew "gnupg"
brew "pinentry-mac"
brew "curl"
brew "wget"

# Search & navigation
brew "ripgrep"
brew "fzf"
brew "fd"
brew "bat"
brew "lsd"
brew "jq"

# Git security & hooks
brew "gitleaks"
brew "lefthook"

# Neovim LSPs & formatters
brew "gopls"
brew "lua-language-server"
brew "stylua"

# Shell
brew "starship"
brew "btop"
brew "tldr"
brew "entr"
brew "smug"
brew "rename"
brew "gawk"

# Cloud & infra
brew "cloudflared"
cask "gcloud-cli"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"

# Build dependencies (kept for compatibility)
brew "icu4c@76"
brew "libgit2"
brew "cairo"
brew "wxwidgets"
brew "harfbuzz"
brew "fop"
brew "gnutls"
brew "pillow"
brew "pkgconf"
brew "protobuf"

# QMK
brew "qmk/qmk/qmk"
cask "qmk-toolbox"

# GUI apps
cask "amethyst"
cask "dbeaver-community"
cask "jordanbaird-ice"
