tap "cloudflare/cloudflare"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "stripe/stripe-cli"
brew "icu4c@76"
brew "libgit2"
brew "bat"
brew "btop"
brew "cairo"
brew "cloudflared"
brew "curl"
brew "wxwidgets"
brew "elixir"
brew "elixir-ls"
brew "entr"
brew "fd"
brew "harfbuzz"
brew "openjdk"
brew "fop"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "jq"
brew "lua-language-server"
brew "neovim"
brew "openssl@1.1"
brew "pillow"
brew "pinentry-mac"
brew "pkgconf"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "python@3.11"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "smug"
brew "starship"
brew "stow"
brew "stylua"
brew "telnet"
brew "tldr"
brew "tmux"
brew "toilet"
brew "wget"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform-ls"
brew "qmk/qmk/qmk"
brew "stripe/stripe-cli/stripe"
cask "amethyst"
cask "dbeaver-community"
cask "google-cloud-sdk"
cask "hiddenbar"
vscode "andreall0.monokai-universe"
vscode "azemoh.one-monokai"
vscode "bradlc.vscode-tailwindcss"
vscode "ckolkman.vscode-postgres"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "florinpatrascu.vscode-elixir-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "matiasolivera.universe"
vscode "mattpocock.ts-error-translator"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "msaraiva.surface"
vscode "mulu-github.jsflowchart"
vscode "naumovs.color-highlight"
vscode "nixon.env-cmd-file-syntax"
vscode "oderwat.indent-rainbow"
vscode "phoenix-liveview-snippets.phoenix-liveview-snippets"
vscode "phoenixframework.phoenix"
vscode "pkief.material-icon-theme"
vscode "qcz.restart-ts-server-button"
vscode "redhat.vscode-yaml"
vscode "royalmist.vscode-eex-format"
vscode "saratravi.elixir-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.javascriptsnippets"
